spec/fixtures/vcr_cassettes/OrdersController/POST_create_subscription_order/Good_card/creates_the_sub.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=2&card[exp_year]=2015&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.2
      Authorization:
      - Bearer sk_test_McolaUo3frJYYalxTTjg0Au1
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - "{\"bindings_version\":\"1.10.2\",\"lang\":\"ruby\",\"lang_version\":\"2.1.0
        p0 (2013-12-25)\",\"platform\":\"x86_64-darwin12.0\",\"publisher\":\"stripe\",\"uname\":\"Darwin
        charlie.local 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan 16 19:40:37 PST
        2014; root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64\"}"
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 25 Feb 2014 23:00:00 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '550'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_3Z2Fc9henKwAam",
          "livemode": false,
          "created": 1393369200,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_3Z2FbFdng2Ks0V",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 2,
            "exp_year": 2015,
            "fingerprint": "0FJgJUWQopgJgoZs",
            "customer": null,
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null
          }
        }
    http_version: 
  recorded_at: Tue, 25 Feb 2014 23:00:01 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card=tok_3Z2Fc9henKwAam&description=beansalad%40idealme.com&plan=1
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.2
      Authorization:
      - Bearer sk_test_McolaUo3frJYYalxTTjg0Au1
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - "{\"bindings_version\":\"1.10.2\",\"lang\":\"ruby\",\"lang_version\":\"2.1.0
        p0 (2013-12-25)\",\"platform\":\"x86_64-darwin12.0\",\"publisher\":\"stripe\",\"uname\":\"Darwin
        charlie.local 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan 16 19:40:37 PST
        2014; root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64\"}"
      Content-Length:
      - '66'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 25 Feb 2014 23:00:01 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2054'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1393369201,
          "id": "cus_3Z2FnTBRhpR7mU",
          "livemode": false,
          "description": "beansalad@idealme.com",
          "email": null,
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "count": 1,
            "url": "/v1/customers/cus_3Z2FnTBRhpR7mU/subscriptions",
            "data": [
              {
                "id": "sub_3Z2FhJvzTkwlAX",
                "plan": {
                  "interval": "month",
                  "name": "Ideal Me Insider Circle 1",
                  "created": 1393018297,
                  "amount": 1995,
                  "currency": "usd",
                  "id": "1",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {}
                },
                "object": "subscription",
                "start": 1393369201,
                "status": "active",
                "customer": "cus_3Z2FnTBRhpR7mU",
                "cancel_at_period_end": false,
                "current_period_start": 1393369201,
                "current_period_end": 1395788401,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null
              }
            ]
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "count": 1,
            "url": "/v1/customers/cus_3Z2FnTBRhpR7mU/cards",
            "data": [
              {
                "id": "card_3Z2FbFdng2Ks0V",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 2,
                "exp_year": 2015,
                "fingerprint": "0FJgJUWQopgJgoZs",
                "customer": "cus_3Z2FnTBRhpR7mU",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              }
            ]
          },
          "default_card": "card_3Z2FbFdng2Ks0V"
        }
    http_version: 
  recorded_at: Tue, 25 Feb 2014 23:00:02 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_3Z2FnTBRhpR7mU
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.2
      Authorization:
      - Bearer sk_test_McolaUo3frJYYalxTTjg0Au1
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - "{\"bindings_version\":\"1.10.2\",\"lang\":\"ruby\",\"lang_version\":\"2.1.0
        p0 (2013-12-25)\",\"platform\":\"x86_64-darwin12.0\",\"publisher\":\"stripe\",\"uname\":\"Darwin
        charlie.local 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan 16 19:40:37 PST
        2014; root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64\"}"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 25 Feb 2014 23:00:02 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2054'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1393369201,
          "id": "cus_3Z2FnTBRhpR7mU",
          "livemode": false,
          "description": "beansalad@idealme.com",
          "email": null,
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "count": 1,
            "url": "/v1/customers/cus_3Z2FnTBRhpR7mU/subscriptions",
            "data": [
              {
                "id": "sub_3Z2FhJvzTkwlAX",
                "plan": {
                  "interval": "month",
                  "name": "Ideal Me Insider Circle 1",
                  "created": 1393018297,
                  "amount": 1995,
                  "currency": "usd",
                  "id": "1",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {}
                },
                "object": "subscription",
                "start": 1393369201,
                "status": "active",
                "customer": "cus_3Z2FnTBRhpR7mU",
                "cancel_at_period_end": false,
                "current_period_start": 1393369201,
                "current_period_end": 1395788401,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null
              }
            ]
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "count": 1,
            "url": "/v1/customers/cus_3Z2FnTBRhpR7mU/cards",
            "data": [
              {
                "id": "card_3Z2FbFdng2Ks0V",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 2,
                "exp_year": 2015,
                "fingerprint": "0FJgJUWQopgJgoZs",
                "customer": "cus_3Z2FnTBRhpR7mU",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              }
            ]
          },
          "default_card": "card_3Z2FbFdng2Ks0V"
        }
    http_version: 
  recorded_at: Tue, 25 Feb 2014 23:00:03 GMT
recorded_with: VCR 2.8.0
